Repository: dad98253/findwords
Catalog: po/*.po
Languages: es, ms

source: welcome_header
ms: Halo dunia!

source: option %s
es: opción %s
ms: pilihan %s

source: warning : the minimum word size cannot be negative, using "0"
es: advertencia: el tamaño mínimo de palabra no puede ser negativo, se usará "0"
ms: amaran : saiz perkataan minimum tidak boleh negatif, menggunakan "0"

source: %s version %s, gittag %s
es: %s versión %s, gittag %s
ms: %s versi %s, gittag %s

source: Usage: %s [-m,--min-word-size n] [string]
ms: Penggunaan: %s [-m,--min-word-size n] [string]

source: finds all of the permutations of a string that are more that n characters in length.
ms: mencari semua permutasi bagi satu rentetan yang lebih daripada n aksara panjangnya.

source: default for n = 2
ms: lalai untuk n = 2

source: default for string = "ADOB"
ms: lalai untuk string = "ADOB"

source: ?? getopt returned character code 0%o ??
es: ?? getopt devolvió el código de carácter 0%o ??
ms: ?? getopt mengembalikan kod watak 0%o ??

source: finding all of the permutations of %s that are more than %i characters long
ms: mencari semua permutasi %s yang lebih daripada %i aksara panjang

source: Usage: %s [OPTION]... [STRING]
es: Uso: %s [OPCIÓN]... [CADENA]
ms: Penggunaan: %s [PILIHAN]... [RENTETAN]

source: Find the permutations of a string.
es: Encuentra las permutaciones de una cadena.
ms: Cari permutasi bagi satu rentetan.

source: -m, --min-word-size=N the minimum size of a derived word
es: -m, --min-word-size=N el tamaño mínimo de una palabra derivada
ms: -m, --min-word-size=N saiz minimum bagi perkataan terbitan

source: -x, --max-word-size=X the maximum size of a derived word
es: -x, --max-word-size=X el tamaño máximo de una palabra derivada
ms: -x, --max-word-size=X saiz maksimum bagi perkataan terbitan

source: -?, --help display this help and exit
es: -?, --help muestra esta ayuda y sale
ms: -?, --help paparkan bantuan ini dan keluar

source: -v, --version output version information and exit
es: -v, --version mostrar información de la versión y salir
ms: -v, --version keluarkan maklumat versi dan keluar

source: STRING the string of characters to be permuted
es: CADENA la cadena de caracteres que se permutará
ms: RENTETAN rentetan aksara yang akan diubah

source: to find the permutations of STRING taken M at a time (i.e., P(STRING,M))
es: para encontrar las permutaciones de CADENA tomadas de M en M (es decir, P(CADENA,M))
ms: untuk mencari permutasi STRING yang diambil M pada satu masa (iaitu, P(STRING,M))

source: enter: permute -m M -x M STRING
es: entrar: permuta -m M -x M CADENA
ms: masukkan: permute -m M -x M STRING

source: ///// ERROR : The length of your string is %s. The maximum allowed is %s.
es: ///// ERROR : La longitud de su cadena es %s. El máximo permitido es %s.
ms: ///// RALAT : Panjang rentetan anda ialah %s. Panjang maksimum yang dibenarkan ialah %s.

source: finding all of the permutations of %s that are more than %lu characters long
ms: mencari semua permutasi %s yang lebih daripada %i aksara panjang
